In [2]:
#Import dependecies
import pandas as pd 
import os

In [14]:
#Filepath to salary
filepath_1 = os.path.join("..","Validated_Data","player_salary_val.csv")

In [17]:
#Salary as df
salary_df = pd.read_csv(filepath_1)
salary_df

     unnamed:_0          player_name         salary
0             0        Stephen Curry  $40,231,758
1             1           Chris Paul  $38,506,482
2             2    Russell Westbrook  $38,506,482
3             3         James Harden  $38,199,000
4             4         Kevin Durant  $38,199,000
..          ...                  ...            ...
467         472       Marques Bolden      $50,752
468         473           Tyler Cook      $50,752
469         475  Sir'Dominic Pointer      $50,752
470         476          Paul Watson      $50,752
471         477           Donta Hall      $50,752

[472 rows x 3 columns]

In [18]:
clean_salary_df = salary_df

In [21]:
#Removie "." for more player mathes
clean_salary_df['player_name'] = clean_salary_df['player_name'].str.replace('.','')
clean_salary_df

     unnamed:_0          player_name         salary
0             0        Stephen Curry  $40,231,758
1             1           Chris Paul  $38,506,482
2             2    Russell Westbrook  $38,506,482
3             3         James Harden  $38,199,000
4             4         Kevin Durant  $38,199,000
..          ...                  ...            ...
467         472       Marques Bolden      $50,752
468         473           Tyler Cook      $50,752
469         475  Sir'Dominic Pointer      $50,752
470         476          Paul Watson      $50,752
471         477           Donta Hall      $50,752

[472 rows x 3 columns]

In [34]:
#Filepath to players for playerID
filepath_2 = os.path.join("..","Validated_Data","players_val.csv")

In [35]:
player_df = pd.read_csv(filepath_2)

#Removie "." for more player mathes
player_df['player_name'] = player_df['player_name'].str.replace('.','')
player_df

           player_name     team_id  player_id  season
0        Royce O'Neale  1610612762    1626220    2019
1     Bojan Bogdanovic  1610612762     202711    2019
2          Rudy Gobert  1610612762     203497    2019
3     Donovan Mitchell  1610612762    1628378    2019
4          Mike Conley  1610612762     201144    2019
...                ...         ...        ...     ...
7223       Lanny Smith  1610612758     201831    2009
7224     Warren Carter  1610612752     201999    2009
7225      Bennet Davis  1610612751     201834    2009
7226    Brian Hamilton  1610612751     201646    2009
7227   Wesley Matthews  1610612762     500032    2009

[7228 rows x 4 columns]

In [36]:
#Clean players for players only in 2018 season
players = player_df.loc[player_df['season'] == 2018]

In [37]:
#Merge for Player_ID as priamry key
merge_salary_df = pd.merge(clean_salary_df, players, on="player_name", how = 'inner')

In [38]:
cleaned_salary_df = merge_salary_df.drop_duplicates(subset=['player_name'])

In [39]:
cleaned_salary_df

,unnamed:_0,player_name,salary,team_id,player_id,season
0,0,Stephen Curry,"$40,231,758",1610612744,201939,2018
1,1,Chris Paul,"$38,506,482",1610612745,101108,2018
2,2,Russell Westbrook,"$38,506,482",1610612760,201566,2018
3,3,James Harden,"$38,199,000",1610612745,201935,2018
4,4,Kevin Durant,"$38,199,000",1610612744,201142,2018
...,...,...,...,...,...,...
434,459,Dusty Hannahs,"$81,678",1610612763,1628605,2018
435,464,Jonah Bolden,"$81,678",1610612755,1628413,2018
436,465,Joe Chealey,"$81,678",1610612766,1629147,2018
437,467,Derrick Walton Jr,"$81,678",1610612741,1628476,2018
438,468,Malik Newman,"$65,975",1610612748,1629005,2018

In [40]:
cleaned_salary_df.to_csv("../outputs/salary_clean.csv", index=False)